# 1.4 Вложенные запросы

---

## Инициализация БД

In [1]:
%load_ext sql
import sqlalchemy
engine = sqlalchemy.create_engine('mysql://user:pass@localhost:3306/stepik')
%sql mysql://user:pass@localhost:3306/stepik

'Connected: user@stepik'

## Заполнение таблицы из CSV файла

In [2]:
# Чтение файла в DataFrame
import pandas as pd
file = 'tables/book_1_3.csv'
df = pd.read_csv(file)
df

   book_id                  title            author   price  amount
0        1     Мастер и Маргарита     Булгаков М.А.  670.99       3
1        2          Белая гвардия     Булгаков М.А.  540.50       5
2        3                  Идиот  Достоевский Ф.М.  460.00      10
3        4      Братья Карамазовы  Достоевский Ф.М.  799.01       3
4        5                  Игрок  Достоевский Ф.М.  480.50      10
5        6  Стихотворения и поэмы       Есенин С.А.  650.00      15

Создание схемы таблицы:

In [3]:
%%sql

  DROP TABLE IF EXISTS book;
CREATE TABLE IF NOT EXISTS book (
       book_id INT PRIMARY KEY AUTO_INCREMENT,
       title   VARCHAR(50),
       author  VARCHAR(30),
       price   DECIMAL(8, 2), #
       amount  INT
);

 * mysql://user:***@localhost:3306/stepik
0 rows affected.
0 rows affected.

[]

In [4]:
# Запись данных в таблицу из DataFrame
types = {
    'book_id': sqlalchemy.Integer(),
    'price'  : sqlalchemy.Numeric(precision=8, scale=2),
    'amount' : sqlalchemy.Integer()
}
df.to_sql('book', con=engine, index=False, if_exists='append', dtype=types, method='multi')

***

# Упражнения

## Вложенный запрос, возвращающий одно значение

Вложенный запрос, возвращающий одно значение, может использоваться  
в условии отбора записей `WHERE` как обычное значение совместно с операциями =, <>, >=, <=, >, <.

**Пример**  
Вывести информацию о самых дешевых книгах, хранящихся на складе.

Для реализации этого запроса нам необходимо получить минимальную цену из столбца `price` таблицы `book` ,  
а затем вывести информацию о тех книгах, цена которых  равна минимальной.  
Первая часть  – поиск  минимума – реализуется вложенным запросом.

In [35]:
%%sql
SELECT title, author, price, amount
  FROM book
 WHERE price = (SELECT MIN(price)
                FROM book)

 * mysql://user:***@localhost:3306/stepik
1 rows affected.

[('Идиот', 'Достоевский Ф.М.', Decimal('460.00'), 10)]

**Задание**  
Вывести информацию (автора, название и цену) о  книгах,  
цены которых меньше или равны средней цене книг на складе.  
Информацию вывести в отсортированном по убыванию цены виде.  
Среднее вычислить как среднее по цене книги.

In [44]:
%%sql
SELECT author, title, price
  FROM book
 WHERE price <= 
       (SELECT AVG(price)
          FROM book)
 ORDER BY price DESC

 * mysql://user:***@localhost:3306/stepik
3 rows affected.

[('Булгаков М.А.', 'Белая гвардия', Decimal('540.50')),
 ('Достоевский Ф.М.', 'Игрок', Decimal('480.50')),
 ('Достоевский Ф.М.', 'Идиот', Decimal('460.00'))]

## Использование вложенного запроса в выражении

Вложенный запрос, возвращающий одно значение, может использоваться в выражениях как обычный операнд,  
например, к нему можно что-то прибавить, отнять и пр.

**Пример**  
Вывести информацию о книгах, количество экземпляров которых отличается  
от среднего количества экземпляров книг на складе более чем на 3.  
То есть нужно вывести и те книги, количество экземпляров которых меньше среднего на 3, и больше среднего на 3.

In [47]:
%%sql
SELECT title, author, price, amount
  FROM book
 WHERE (SELECT ROUND(AVG(amount))
          FROM book) 
       NOT BETWEEN amount - 3 
               AND amount + 3

 * mysql://user:***@localhost:3306/stepik
3 rows affected.

[('Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 ('Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 3),
 ('Стихотворения и поэмы', 'Есенин С.А.', Decimal('650.00'), 15)]

In [50]:
%%sql
SELECT title, author, price, amount
  FROM book
 WHERE ABS(amount - (SELECT AVG(amount) 
                       FROM book)) > 3

 * mysql://user:***@localhost:3306/stepik
3 rows affected.

[('Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 ('Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 3),
 ('Стихотворения и поэмы', 'Есенин С.А.', Decimal('650.00'), 15)]

**Задание**  
Вывести информацию (автора, название и цену) о тех книгах,  
цены которых превышают минимальную цену книги на складе  
не более чем на 150 рублей в отсортированном по возрастанию цены виде.

In [57]:
%%sql
SELECT author, title, price
  FROM book
 WHERE price - 150 <= (SELECT MIN(price) 
                         FROM book)
 ORDER BY price

 * mysql://user:***@localhost:3306/stepik
3 rows affected.

[('Достоевский Ф.М.', 'Идиот', Decimal('460.00')),
 ('Достоевский Ф.М.', 'Игрок', Decimal('480.50')),
 ('Булгаков М.А.', 'Белая гвардия', Decimal('540.50'))]

## Вложенный запрос, оператор `IN`

Вложенный запрос может возвращать несколько значений одного столбца.   
Оператор `IN` определяет, совпадает ли указанное в логическом выражении значение с одним из значений, содержащихся во вложенном запросе,  
при этом логическое выражение получает значение истина.  
Оператор `NOT IN` выполняет обратное действие – выражение истинно, если значение не содержится во вложенном запросе.

**Пример**  
Вывести информацию о книгах тех авторов, общее количество экземпляров книг которых не менее 12.

In [4]:
%%sql
SELECT title, author, price, amount
  FROM book
 WHERE author IN(
       SELECT author
         FROM book
        GROUP BY author
       HAVING SUM(amount) >= 12)

 * mysql://user:***@localhost:3306/stepik
4 rows affected.

[('Идиот', 'Достоевский Ф.М.', Decimal('460.00'), 10),
 ('Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 3),
 ('Игрок', 'Достоевский Ф.М.', Decimal('480.50'), 10),
 ('Стихотворения и поэмы', 'Есенин С.А.', Decimal('650.00'), 15)]

**Задание**  
Вывести информацию (автора, книгу и количество) о тех книгах, количество экземпляров которых в таблице book не дублируется.

In [46]:
%%sql
SELECT author, title, amount
  FROM book
 WHERE amount IN(
       SELECT amount
         FROM book
        GROUP BY amount
       HAVING COUNT(amount) = 1)

 * mysql://user:***@localhost:3306/stepik
2 rows affected.

[('Булгаков М.А.', 'Белая гвардия', 5),
 ('Есенин С.А.', 'Стихотворения и поэмы', 15)]

## Вложенный запрос, операторы `ANY` и `ALL`

При использовании оператора **`ANY`** в результирующую таблицу будут включены все записи, для которых   
выражение со знаком отношения верно **хотя бы для одного элемента** результирующего запроса.  
Как работает оператор `ANY()` :

- `amount > ANY (10, 12)` эквивалентно `amount > 10`
- `amount < ANY (10, 12)` эквивалентно `amount < 12`
- `amount = ANY (10, 12)` эквивалентно `(amount = 10) OR (amount = 12)`, а также amount `IN  (10,12)`
- `amount <> ANY (10, 12)` вернет все записи с любым значением `amount`, включая 10 и 12

При использовании оператора **`ALL`** в результирующую таблицу будут включены все записи, для которых   
выражение со знаком отношения верно **для всех элементов** результирующего запроса.  
Как работает оператор `ALL()` :

- `amount > ALL (10, 12)` эквивалентно `amount > 12`
- `amount < ALL (10, 12)` эквивалентно `amount < 10`
- `amount = ALL (10, 12)` не вернет ни одной записи, так как эквивалентно `(amount = 10) AND (amount = 12)`
- `amount <> ALL (10, 12)` вернет все записи кроме тех, в которых `amount` равно 10 или 12

>**Важно!** Операторы `ALL` и `ANY` можно использовать только с вложенными запросами.  
В примерах выше `(10, 12)` приводится как результат вложенного запроса просто для того,  
чтобы показать как эти операторы работают.  
**В запросах так записывать нельзя.**

**Пример 1**  
Вывести информацию о тех книгах, количество которых меньше самого маленького среднего количества книг каждого автора.

In [6]:
%%sql
SELECT title, author, price, amount
  FROM book
 WHERE amount < ALL(
       SELECT AVG(amount)
         FROM book
        GROUP BY author)

 * mysql://user:***@localhost:3306/stepik
2 rows affected.

[('Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 ('Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 3)]

**Пример 2**  
Вывести информацию о тех книгах, количество которых меньше самого большого среднего количества книг каждого автора.

In [7]:
%%sql
SELECT title, author, price, amount
  FROM book
 WHERE amount < ANY(
       SELECT AVG(amount)
         FROM book
        GROUP BY author)

 * mysql://user:***@localhost:3306/stepik
5 rows affected.

[('Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 ('Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 5),
 ('Идиот', 'Достоевский Ф.М.', Decimal('460.00'), 10),
 ('Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 3),
 ('Игрок', 'Достоевский Ф.М.', Decimal('480.50'), 10)]

**Задание**  
Вывести информацию о книгах(автор, название, цена), цена которых меньше самой большой из минимальных цен,  
вычисленных для каждого автора.

In [8]:
%%sql
SELECT author, title, price
  FROM book
 WHERE price < ANY(
       SELECT MIN(price)
         FROM book
        GROUP BY author)

 * mysql://user:***@localhost:3306/stepik
3 rows affected.

[('Булгаков М.А.', 'Белая гвардия', Decimal('540.50')),
 ('Достоевский Ф.М.', 'Идиот', Decimal('460.00')),
 ('Достоевский Ф.М.', 'Игрок', Decimal('480.50'))]

## Вложенный запрос после `SELECT`

 Вложенный запрос может располагаться после ключевого слова `SELECT` .  
 В этом случае результат выполнения запроса выводится в отдельном столбце результирующей таблицы.  
 При этом результатом запроса может быть только одно значение, тогда оно будет повторяться во всех строках.  
 Также вложенный запрос может использоваться в выражениях.

**Пример**  
Вывести информацию о книгах, количество экземпляров которых отличается  
от среднего количества экземпляров книг на складе более чем на 3,  
а также указать среднее значение количества экземпляров книг.

In [24]:
%%sql
SELECT title, author, price, amount, 
       FLOOR((
        SELECT AVG(amount) AS avg_amount
          FROM book
       )) AS Среднее_количество
  FROM book
 WHERE ABS(amount - (
     SELECT AVG(amount) AS avg_amount
              FROM book)) > 3

 * mysql://user:***@localhost:3306/stepik
3 rows affected.

[('Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3, 7),
 ('Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 3, 7),
 ('Стихотворения и поэмы', 'Есенин С.А.', Decimal('650.00'), 15, 7)]

**Задание**  
Посчитать сколько и каких экземпляров книг нужно заказать поставщикам,  
чтобы на складе стало одинаковое количество экземпляров каждой книги,  
равное значению самого большего количества экземпляров одной книги на складе.  
Вывести название книги, ее автора, текущее количество экземпляров на складе  
и количество заказываемых экземпляров книг.  
Последнему столбцу присвоить имя **Заказ**.

In [45]:
%%sql
SELECT title, author, amount, (
       SELECT MAX(amount)
         FROM book
       ) - amount AS Заказ
  FROM book
 WHERE amount < (SELECT MAX(amount)
                   FROM book)

 * mysql://user:***@localhost:3306/stepik
5 rows affected.

[('Мастер и Маргарита', 'Булгаков М.А.', 3, 12),
 ('Белая гвардия', 'Булгаков М.А.', 5, 10),
 ('Идиот', 'Достоевский Ф.М.', 10, 5),
 ('Братья Карамазовы', 'Достоевский Ф.М.', 3, 12),
 ('Игрок', 'Достоевский Ф.М.', 10, 5)]